\tableofcontents
\newpage
\section{(1) Первое задание}
Задайте функцию $f(x) = x^{3}$ на отрезке $[0, 1]$. Очевидно, определенный интеграл от функции $f(x)$ на этом отрезке равен $\frac{1}{4}$. Напишите программу, вычисляющую значение интеграла по формулам трапеций и Симпсона. Какую максимальную теоретическую ошибку мы при этом допускаем? Найдите реальные значение погрешности (абсолютное значение разности между теоретическим и аналитическим решением). Почему при вычислении интеграла по формуле Симпсона от данной функции ошибка равна нулю? Какие бы получились значения погрешностей для квадратичнойи линейной функций (предположите и проведите численный эксперимент для $f_{2}(x) = x^{2}$, $f_{1}(x) = \frac{x}{2}$ на отрезке $[0, 1]$).\\[2mm]

Формула трапеции:
\[
  \int_{a}^{b} f(x)dx \approx \sum_{i=1}^{n }h\frac{f(x_{i}) + f(x_{i-1})}{2}
\]
Погрешность для нее:
\[
  \frac{h^{2}(b-a)}{12}M_{2}\text{, где } M_{2} = \max_{[a,b]}|f^{''}(x)|
\]
Формула Симпсона:
\[
  \int_{a}^{b} f(x)dx \approx \frac{h}{6}(f_{i-1} + 4f_{i-1/2} + f_{i})
\]
Погрешность для неё:
\[
  |\Psi| \leq \frac{h^{2}(b-a)}{2880}M_{4} \text{, где } M_{4} = \max_{[a,b]}|f^{(4)}(x)|
\]
Функция для расчета по формуле трапеции:
\begin{lstlisting}
  function I = trapeze(f, x, h)
    I = 0;
    for i = 2 : length(x)
        I = I + (h/2)*(f(x(i)) + f(x(i-1)));
    end
  end
\end{lstlisting}

Функция для расчета по формуле Симпсона:
\begin{lstlisting}
  function I = simpson(f, x, h)
    I = 0;
    for i = 2 : length(x)
    I = I+(h/6)*(f(x(i-1))+4*f(x(i)-h/2)+f(x(i)));
    end
  end
\end{lstlisting}
Решение задачи:
\begin{lstlisting}
  f = @(x) x.^3; % |Функция|
  a = 0; b = 1; % |Границы|
  x = linspace(0, 1, 10); % |Промежуток|
  h = x(2) - x(1); % |Шаг разбиения|
  re = 1/4;
  M2_f = 6; %max abs(f''(x)), [x(i-1),x(i)]

  simpson(f, x, h)
  trapeze(f, x, h)
  teor_eps_trapeze = M2_f * (b - a) * h^2/12
  eps_simpson = abs(simpson(f, x, h) - re)
  eps_trapeze = abs(trapeze(f, x, h) - re)

  % Погрешности:
  Q = @(x)x.^2;
  L = @(x)x/2;
  disp('|Ошибка для квадратичной функции|:')
  abs(simpson(Q, x, h) - 1/3)
  disp('|Ошибка для линейной функции|:')
  abs(simpson(L, x, h) - 1/4)
\end{lstlisting}

Значение интеграла по формуле Симпсона: $I = 0.2500$\\
Значение интеграла по формуле трапеций: $I = 0.2531$\\
Теоретическая ошибка по формуле Симпсона: $0$\\
Теоретическая ошибка по формуле трапеций: $teor\_eps\_trapeze = 6.1728e-03$\\
Реальная ошибка по формуле Симпсона: $0$\\
Реальная ошибка по формуле трапеций: $eps\_trapeze = 3.0864e-03$\\
Ошибка для квадратичной функции:\\
$ans = 5.5511e-17$\\
Ошибка для линейной функции:\\
$ans = 2.7756e-17$\\

Погрешность при вычислении методом Симпсона кубической функции равно нулю, так как формула Симпсона для всех многочленов третей степени не имеет погрешности. Связано это с тем, что формула основана на интерполяционном многочлене Лагранжа второй степени с тремя узлами интерполяции.

\section{(2) Второе задание}
Используя соотношение $\int_{0}^{1}\frac{1}{1+x^{2}}dx = arctg(1)$ найдите значение числа $\pi$ с точностью $10^{-6}$. В данном задании в процессе вычислений нельзя ис-пользовать встроенную константу \textbf{pi} для определения величины шага. Изкаких соображений выбирался шаг для получения указанной точности?\\[2mm]
Выразим $h$ из формул теоретических погрешностей погрешностей. Для трапеции:
\[
  \epsilon = \frac{h^{2}(b-a)}{12}M \Rightarrow h = \sqrt{\frac{12\epsilon}{(b-a)M}}
\]
Для формулы Симпсона:
\[
  \epsilon = \frac{h^{4}(b-a)}{2880}M \Rightarrow h = \sqrt[4]{\frac{2880\epsilon}{(b-a)M}}
\]

\begin{lstlisting}
  f = @(x) 1/(1 + x.^2); % |интегрируемая функция|
  eps = 10^-6; % |Погрешность|
  a = 0; b = 1; % |границы интегрирования|

  x = a : 0.01 : b;
  d2f = 2.*(4.*x.^2-x.^2-1)./((x.^2+1).^3); % |2-ая производная|

  d4f=(24.*(16.*x.^4-12.*(x.^2).*(x.^2+1)+(x.^2+1).^2))./(x.^2+1).^5;%4 |производная|

  M2 = max(d2f);
  M4 = max(d4f);

  h_simpson = (2880*eps/((b - a) * M4))^(1/4); % |шаг для симпсона|
  x_S = 0 : 0.1 : 1;

  h_trapeze = sqrt((12*eps)/((b - a) * M2));
  x_T = 0 : 0.001 : 1;

  pi_s = 4*simpson(f, x_S, h_simpson)
  pi_t = 4*trapeze(f, x_T, h_trapeze)

  printf('|Шаг по формуле Симпсона|: hS = %f, \n', h_simpson);
  printf('|Шаг по формуле трапеций|: hT = %f, \n', h_trapeze);
  printf('|PI по формуле Симпсона|: PI_S = %f, \n', pi_s);
  printf('|PI по формуле трапеций|: PI_T = %f, \n', pi_t);
\end{lstlisting}
Шаг по формуле Симпсона: hS = 0.104664,\\
Шаг по формуле трапеций: hT = 0.004899,\\
PI по формуле Симпсона: $PI\_S  = 3.141593$,\\
PI по формуле трапеций: $PI\_T  = 31.415925$,\\

\section{(3) Третье задание}
Реализовать предыдущее задание, определяя точность методом Рунге. При численном вычислении интегралов последовательно с шагами $h$ и $\frac{h}{4}$ можно сократить число арифметических операций. Заметим, что приближенное значение интеграла $I_{\frac{h}{2}}$ есть сумма, часть слагаемых которойвозможно уже участвовало при вычислении $I_{h}$. Поэтому можно получить $I_{\frac{h}{2}}$ используя числовое значение $I_{h}$. то позволяет избежать повторногосуммирования части слагаемых.

Попытка сократить количество арифметических операций приводит к замедлению сходимости к требуемой точности из-за увеличения в несколько раз кол-во итераций. Но, несмотря на это, реализуем этот метод, как указано в задании:
\begin{lstlisting}
  functionI = simpson_2(f,x)
  % где f -подынтегральная функция,
  % х -точки на отрезке интегрирования,
    I = 0; %начальное значение интеграла
    h = x(2)-x(1); %шаг разбиения
    for i = 2:length(x)
        I = I+(h/6)*(f(x(i-1))+4*f(x(i)-h/2)+f(x(i)));
    end
  end
\end{lstlisting}
\begin{lstlisting}
  function I = trapecia_2(f,x)
  % где f -подынтегральная функция,
  % х -точки на отрезке интегрирования,
    I = 0; % | начальное значение интеграла|
    h = x(2)-x(1); %| шаг разбиения|
    for i = 2:length(x)
        I = I+( f(x(i-1))+f(x(i)) )*h/2;
    end
  end
\end{lstlisting}
\begin{lstlisting}
  functionI = econom(f,x,I0)
  % где f –подынтегральная функция,
  % х -точки на отрезке интегрирования,
  % I0 -начальное значение интеграла
    h = 2*(x(2)-x(1));
    I= I0/3+(2*h/3)*sum(arrayfun(@(k)f(x(k)), 2:2:length(x)-1));
  end
\end{lstlisting}
Подставим значения:
\begin{lstlisting}
  a = 0; b = 1; n = 2; %| исходные данные|
  x = linspace(a,b,n); %| массив значений|
  хf = @(x)1/(1+x.^2); %| исходная функция|
  eps_s = 1; %| начальное значение ошибки Симпсона|
  while eps_s > 10^-6
    temp = linspace(a,b,2*n);
    eps_s = (1/15)*abs(simpson_2(f,x)-simpson_2(f,temp));
    x = temp;
    n = 2*n;
  end
  disp('|Ошибка по формуле Симпсона|:')
  err_PI_S = abs(pi-4*simpson_2(f,x)) %| значение ошибки по Симпсону|
  disp('|Шаг по Симпсону|:')
  h_S = x(2)-x(1) %| шаг по симпсону|
  n = 2;
  x = linspace(a,b,n);
  eps_t = 1; %| начальное значение ошибки трапеций|
  I0 = trapecia_2(f,x); %| начальное значение интеграла|
  while eps_t > 10^-6
    x = linspace(a,b,2*n);
    I1 = econom(f,x,I0);
    eps_t = (1/3)*abs(I0-I1);
    I0 = I1;
    n = 2*n;
  end
  disp('|Ошибка по формуле трапеций|:')
  eps_PI_T = abs(pi-4*trapecia_2(f,x)) %| значение ошибки по трапециям|
  disp('|Шаг по трапециям|:')
  h_T = x(2)-x(1) %| шаг по трапециям|
  \end{lstlisting}
